# SERIES

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a' : 10, 'b' : 20, 'c' : 30}

In [4]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(labels, my_list)

10    a
20    b
30    c
dtype: object

In [12]:
pd.Series(index = labels, data = my_list)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [14]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
a = [i for i in range(1,5)]
b = [i for i in range(5,9)]
c = [i for i in range(9,13)]

In [18]:
a

[1, 2, 3, 4]

In [19]:
b

[5, 6, 7, 8]

In [20]:
c

[9, 10, 11, 12]

In [22]:
pd.DataFrame(data = [a,b,c],
            index = 'a b c'.split(),
            columns = 'w x y z'.split())

   w   x   y   z
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [23]:
pd.DataFrame(data = [a,b,c],
            index = 'x y z'.split(),
            columns = 'a b c d'.split())

   a   b   c   d
x  1   2   3   4
y  5   6   7   8
z  9  10  11  12

In [24]:
pd.DataFrame(data = list(zip(a,b,c)),
            index = 'w x y z'.split(),
            columns = 'a b c'.split())

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [25]:
my_list2 = [[1,2,3,4],
           [5,6,7,8],
           [9,10,11,12],
           [13,14,15,16]]
my_list2

[[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]]

In [26]:
pd.DataFrame(my_list2,
            index = 'a b c d'.split(),
            columns = 'w x y z'.split())

    w   x   y   z
a   1   2   3   4
b   5   6   7   8
c   9  10  11  12
d  13  14  15  16

In [27]:
pd.DataFrame(my_list2,
            index = 'a b c d'.split(),
            columns = 'w x y z'.split()).T

   a  b   c   d
w  1  5   9  13
x  2  6  10  14
y  3  7  11  15
z  4  8  12  16

In [29]:
from numpy.random import randn
np.random.seed(101)

In [30]:
pd.DataFrame(randn(5,4),
            index = 'A B C D E'.split(),
            columns = 'W X Y Z'.split())

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
my_d = {'a' : [1,2,3,4],
       'b' : [5,6,7,8],
       'c' : [9,10,11,12]}
my_d

{'a': [1, 2, 3, 4], 'b': [5, 6, 7, 8], 'c': [9, 10, 11, 12]}

In [33]:
pd.DataFrame(my_d,
            index = 'w x y z'.split())

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

#  INDEXING DATAFRAME

In [36]:
import pandas as pd
import numpy as np

In [38]:
from numpy.random import randn
np.random.seed(101)

In [40]:
df = pd.DataFrame(randn(5,4),
                 index = 'A B C D E'.split(),
                 columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [41]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [42]:
df['W']['A']

0.3026654485851825

In [43]:
df['W'][0:2]

A    0.302665
B   -0.134841
Name: W, dtype: float64

In [44]:
type(df['W'])

pandas.core.series.Series

In [46]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [47]:
df['min'] = [1,2,3,4,5]
df

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
B -0.134841  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3
D -0.497104 -0.754070 -0.943406  0.484752    4
E -0.116773  1.901755  0.238127  1.996652    5

In [48]:
df.min

<bound method NDFrame._add_numeric_operations.<locals>.min of           W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
B -0.134841  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3
D -0.497104 -0.754070 -0.943406  0.484752    4
E -0.116773  1.901755  0.238127  1.996652    5>

In [49]:
df['min']

A    1
B    2
C    3
D    4
E    5
Name: min, dtype: int64

In [50]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [51]:
df.loc['A']

W      0.302665
X      1.693723
Y     -1.706086
Z     -1.159119
min    1.000000
Name: A, dtype: float64

In [52]:
df.loc['A':'C']

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
B -0.134841  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3

In [54]:
df.iloc[2]

W      0.807706
X      0.072960
Y      0.638787
Z      0.329646
min    3.000000
Name: C, dtype: float64

In [55]:
df.iloc[0:3]

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
B -0.134841  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3

In [56]:
df.iloc[0:4:2]

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
C  0.807706  0.072960  0.638787  0.329646    3

In [57]:
df.iloc[0:3:2]

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
C  0.807706  0.072960  0.638787  0.329646    3

In [59]:
df.iloc[0,3]

-1.1591194155484297

In [60]:
df.iloc[[1,3]]

          W         X         Y         Z  min
B -0.134841  0.390528  0.166905  0.184502    2
D -0.497104 -0.754070 -0.943406  0.484752    4

In [61]:
df

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
B -0.134841  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3
D -0.497104 -0.754070 -0.943406  0.484752    4
E -0.116773  1.901755  0.238127  1.996652    5

In [62]:
df > 0

       W      X      Y      Z   min
A   True   True  False  False  True
B  False   True   True   True  True
C   True   True   True   True  True
D  False  False  False   True  True
E  False   True   True   True  True

In [63]:
df[df>0]

          W         X         Y         Z  min
A  0.302665  1.693723       NaN       NaN    1
B       NaN  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3
D       NaN       NaN       NaN  0.484752    4
E       NaN  1.901755  0.238127  1.996652    5

In [64]:
df[df['W'] > 0]

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
C  0.807706  0.072960  0.638787  0.329646    3

In [65]:
df[df['W'] > 0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [68]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [70]:
df

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1
B -0.134841  0.390528  0.166905  0.184502    2
C  0.807706  0.072960  0.638787  0.329646    3
D -0.497104 -0.754070 -0.943406  0.484752    4
E -0.116773  1.901755  0.238127  1.996652    5

In [72]:
df[(df['W'] > 0) & (df['Y'] < 0)]

          W         X         Y         Z  min
A  0.302665  1.693723 -1.706086 -1.159119    1

# PANDAS FOR DATAFRAME MANIPULATION

In [1]:
import pandas as pd
import numpy as np

In [8]:
from numpy.random import randn
np.random.seed(101)

In [36]:
df = pd.DataFrame(randn(5,4),
                 index = 'A B C D E'.split(),
                 columns = 'W X Y Z'.split())

In [14]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [5]:
df.loc['new'] = [1,2,3,4]

In [6]:
df

            W         X         Y         Z
A    2.706850  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
D    0.188695 -0.758872 -0.933237  0.955057
E    0.190794  1.978757  2.605967  0.683509
new  1.000000  2.000000  3.000000  4.000000

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [15]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [16]:
df.insert(2,'new',[1,2,3,4,5])
df

          W         X  new         Y         Z
A  0.302665  1.693723    1 -1.706086 -1.159119
B -0.134841  0.390528    2  0.166905  0.184502
C  0.807706  0.072960    3  0.638787  0.329646
D -0.497104 -0.754070    4 -0.943406  0.484752
E -0.116773  1.901755    5  0.238127  1.996652

In [17]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [18]:
df

          W         X  new         Y         Z
A  0.302665  1.693723    1 -1.706086 -1.159119
B -0.134841  0.390528    2  0.166905  0.184502
C  0.807706  0.072960    3  0.638787  0.329646
D -0.497104 -0.754070    4 -0.943406  0.484752
E -0.116773  1.901755    5  0.238127  1.996652

In [19]:
df.drop('new', axis = 1, inplace = True) 
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [20]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [21]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [22]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [24]:
df['States'] = newind
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [25]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [26]:
df.set_index('States', inplace = True)
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [27]:
outside = ['Jakarta', 'Jakarta', 'Jakarta',
          'Surabaya', 'Surabaya', 'Surabaya']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('Jakarta', 1),
 ('Jakarta', 2),
 ('Jakarta', 3),
 ('Surabaya', 1),
 ('Surabaya', 2),
 ('Surabaya', 3)]

In [28]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([( 'Jakarta', 1),
            ( 'Jakarta', 2),
            ( 'Jakarta', 3),
            ('Surabaya', 1),
            ('Surabaya', 2),
            ('Surabaya', 3)],
           )

In [29]:
df = pd.DataFrame(np.random.randint(1,100,(6,2)),
                 index = hier_index,
                 columns = ['Restoran A', 'Restoran B'])
df

            Restoran A  Restoran B
Jakarta  1          55          87
         2          10          46
         3           3          19
Surabaya 1          59          93
         2          12          11
         3          95          36

In [30]:
df.loc['Jakarta']

   Restoran A  Restoran B
1          55          87
2          10          46
3           3          19

In [31]:
df.loc['Jakarta'].loc[1]

Restoran A    55
Restoran B    87
Name: 1, dtype: int32

In [32]:
df.xs('Jakarta')

   Restoran A  Restoran B
1          55          87
2          10          46
3           3          19

In [33]:
df.xs(['Jakarta', 1])

Restoran A    55
Restoran B    87
Name: (Jakarta, 1), dtype: int32

In [34]:
df.index.names = ['City', 'Location']
df

                   Restoran A  Restoran B
City     Location
Jakarta  1                 55          87
         2                 10          46
         3                  3          19
Surabaya 1                 59          93
         2                 12          11
         3                 95          36

In [35]:
df.xs(1, level = 'Location')

          Restoran A  Restoran B
City
Jakarta           55          87
Surabaya          59          93

In [37]:
df

          W         X         Y         Z
A  1.241440  0.190978 -1.245347  0.952183
B  1.301380 -0.167320  0.050221  1.556790
C  1.345434  1.501737 -0.633348 -0.487281
D -1.647469  0.543758 -1.210949 -0.365949
E  0.632181 -0.393214 -1.826066  1.257824

In [39]:
df['States'] = newind
df

          W         X         Y         Z States
A  1.241440  0.190978 -1.245347  0.952183     CA
B  1.301380 -0.167320  0.050221  1.556790     NY
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
E  0.632181 -0.393214 -1.826066  1.257824     CO

In [40]:
df.sort_values('States')

          W         X         Y         Z States
A  1.241440  0.190978 -1.245347  0.952183     CA
E  0.632181 -0.393214 -1.826066  1.257824     CO
B  1.301380 -0.167320  0.050221  1.556790     NY
D -1.647469  0.543758 -1.210949 -0.365949     OR
C  1.345434  1.501737 -0.633348 -0.487281     WY

In [42]:
df.sort_values('States', ascending = False)

          W         X         Y         Z States
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
B  1.301380 -0.167320  0.050221  1.556790     NY
E  0.632181 -0.393214 -1.826066  1.257824     CO
A  1.241440  0.190978 -1.245347  0.952183     CA

In [43]:
df.sort_values('States', ascending = False, inplace = True)
df

          W         X         Y         Z States
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
B  1.301380 -0.167320  0.050221  1.556790     NY
E  0.632181 -0.393214 -1.826066  1.257824     CO
A  1.241440  0.190978 -1.245347  0.952183     CA

In [45]:
df.sort_values(by = ['Z', 'Y'])

          W         X         Y         Z States
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
A  1.241440  0.190978 -1.245347  0.952183     CA
E  0.632181 -0.393214 -1.826066  1.257824     CO
B  1.301380 -0.167320  0.050221  1.556790     NY

In [47]:
df.sort_values(by = ['Z', 'Y'],
              ascending = [True, False])

          W         X         Y         Z States
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
A  1.241440  0.190978 -1.245347  0.952183     CA
E  0.632181 -0.393214 -1.826066  1.257824     CO
B  1.301380 -0.167320  0.050221  1.556790     NY

In [48]:
df.sort_values(by = ['Z', 'Y'],
              ascending = [True, False],
              inplace = True)
df

          W         X         Y         Z States
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
A  1.241440  0.190978 -1.245347  0.952183     CA
E  0.632181 -0.393214 -1.826066  1.257824     CO
B  1.301380 -0.167320  0.050221  1.556790     NY

In [49]:
df.sort_index()

          W         X         Y         Z States
A  1.241440  0.190978 -1.245347  0.952183     CA
B  1.301380 -0.167320  0.050221  1.556790     NY
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
E  0.632181 -0.393214 -1.826066  1.257824     CO

In [50]:
df

          W         X         Y         Z States
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
A  1.241440  0.190978 -1.245347  0.952183     CA
E  0.632181 -0.393214 -1.826066  1.257824     CO
B  1.301380 -0.167320  0.050221  1.556790     NY

In [53]:
df.sort_index(inplace = True)
df

          W         X         Y         Z States
A  1.241440  0.190978 -1.245347  0.952183     CA
B  1.301380 -0.167320  0.050221  1.556790     NY
C  1.345434  1.501737 -0.633348 -0.487281     WY
D -1.647469  0.543758 -1.210949 -0.365949     OR
E  0.632181 -0.393214 -1.826066  1.257824     CO

# PANDAS FUNCTIONALITY

In [54]:
import seaborn as sns

In [55]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [56]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [59]:
df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [57]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [60]:
df.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [62]:
df.shape

(891, 15)

In [64]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [65]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [66]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [67]:
df.describe(include = object)

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [70]:
df['age'].mean()

29.69911764705882

In [71]:
df['age'].median()

28.0

In [72]:
df['age'].std()

14.526497332334044

In [73]:
df['age'].max()

80.0

In [74]:
df['age'].min()

0.42

In [75]:
df['sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

In [76]:
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [77]:
df['sex'].nunique()

2

In [78]:
df['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [79]:
df = pd.DataFrame({'A' : [1,2,np.nan],
                   'B' : [5,np.nan, np.nan],
                   'C' : [1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [81]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [82]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [83]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [84]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [86]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [87]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [88]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [89]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person' : ['Sam', 'Charlie', 'Amy', 'Vannesa', 'Carl', 'Sarah'],
       'Sales' : [200,120,340,123,243,350]}

In [90]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vannesa    123
4      FB     Carl    243
5      FB    Sarah    350

In [91]:
df.groupby('Company')

In [92]:
by_comp = df.groupby('Company')

In [94]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     231.5

In [95]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     231.5

In [96]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     153.442172

In [97]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     153.442172

In [98]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    123

In [99]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vannesa    340

In [100]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [101]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  231.5  153.442172  123.0  177.25  231.5  285.75  340.0

In [104]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  231.500000
      std     75.660426   56.568542  153.442172
      min    243.000000  120.000000  123.000000
      25%    269.750000  140.000000  177.250000
      50%    296.500000  160.000000  231.500000
      75%    323.250000  180.000000  285.750000
      max    350.000000  200.000000  340.000000

In [108]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# PANDAS: MERGING, JOINING & CONCATENATING

In [131]:
left = pd.DataFrame({'key' : ['K0', 'K1', 'K2', 'K3'],
                     'A' : ['A0', 'A1', 'A2', 'A3'],
                     'B' : ['B0', 'B1', 'B2', 'B3']})

In [110]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [132]:
right = pd.DataFrame({'key' : ['K0', 'K1', 'K3', 'K4'],
                      'C' : ['C0', 'C1', 'C2', 'C3'],
                      'D' : ['D0', 'D1', 'D2', 'D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K3  C2  D2
3  K4  C3  D3

In [114]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C2  D2

In [115]:
pd.merge(left, right, on='key').transpose()

      0   1   2
key  K0  K1  K3
A    A0  A1  A3
B    B0  B1  B3
C    C0  C1  C2
D    D0  D1  D2

In [116]:
pd.merge(left, right, how = 'outer', on = 'key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C2   D2
4  K4  NaN  NaN   C3   D3

In [117]:
pd.merge(left, right, how = 'left', on = 'key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C2   D2

In [119]:
pd.merge(left, right, how = 'right', on = 'key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C2  D2
3  K4  NaN  NaN  C3  D3

In [120]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [121]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K3  C2  D2
3  K4  C3  D3

In [125]:
left = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                     'B' : ['B0', 'B1', 'B2', 'B3']},
                    index = ['K0', 'K1', 'K2', 'K3'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [126]:
right = pd.DataFrame({'C' : ['C0', 'C1', 'C2', 'C3'],
                      'D' : ['D0', 'D1', 'D2', 'D3']},
                    index = ['K0', 'K1', 'K3', 'K4'])
right

     C   D
K0  C0  D0
K1  C1  D1
K3  C2  D2
K4  C3  D3

In [127]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2  NaN  NaN
K3  A3  B3   C2   D2

In [128]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K1  C1  D1   A1   B1
K3  C2  D2   A3   B3
K4  C3  D3  NaN  NaN

In [129]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C1   D1
K2   A2   B2  NaN  NaN
K3   A3   B3   C2   D2
K4  NaN  NaN   C3   D3

In [133]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [134]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K3  C2  D2
3  K4  C3  D3

In [136]:
pd.concat([left, right])

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K3  NaN  NaN   C2   D2
3  K4  NaN  NaN   C3   D3

In [138]:
pd.concat([left, right], axis = 1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K3  C2  D2
3  K3  A3  B3  K4  C3  D3

# PANDAS OPERATIONS

In [139]:
df = pd.DataFrame({'col1' : [1,2,3,4],
                  'col2' : [444, 555, 666, 444],
                  'col3' : ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [140]:
def times2 (x) :
    return x*2

In [141]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [142]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [143]:
len(df['col3'])

4

In [144]:
df['col1'].apply(lambda x : x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [145]:
df['col3'].apply(lambda x : x[1])

0    b
1    e
2    h
3    y
Name: col3, dtype: object

In [146]:
df['col3'].apply(lambda x : len(x))

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [147]:
df['col4'] = df['col1'] + df['col2']
df

   col1  col2 col3  col4
0     1   444  abc   445
1     2   555  def   557
2     3   666  ghi   669
3     4   444  xyz   448

In [151]:
df['col5'] = df['col1'] - df['col2']
df

   col1  col2 col3  col4  col5
0     1   444  abc   445  -443
1     2   555  def   557  -553
2     3   666  ghi   669  -663
3     4   444  xyz   448  -440

In [152]:
df['col6'] = df['col2'] / df['col1']
df

   col1  col2 col3  col4  col5   col6
0     1   444  abc   445  -443  444.0
1     2   555  def   557  -553  277.5
2     3   666  ghi   669  -663  222.0
3     4   444  xyz   448  -440  111.0

In [153]:
df['col7'] = df['col1'] * df['col1']
df

   col1  col2 col3  col4  col5   col6  col7
0     1   444  abc   445  -443  444.0     1
1     2   555  def   557  -553  277.5     4
2     3   666  ghi   669  -663  222.0     9
3     4   444  xyz   448  -440  111.0    16

In [154]:
data = {'A' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B' : ['one', 'one', 'two', 'two', 'one', 'one'],
       'C' : ['x', 'y', 'x', 'y', 'x', 'y'],
       'D' : [1,3,2,5,4,1]}

In [156]:
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [157]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# PANDAS DATA INPUT & OUTPUT

In [12]:
import pandas as pd
import numpy as np

In [7]:
pd.read_excel('Database_Calon_Konsumen_Symphony.xlsx', sheet_name = 'Sheet1')

FileNotFoundError: [Errno 2] No such file or directory: 'Database_Calon_Konsumen_Symphony.xlsx'

In [8]:
df = pd.DataFrame({
    'nama' : ['Andi', 'Budi', 'Caca'],
    'umur' : [24 , 18, 30],
    'pekerjaan' : ['Frond-End Developer', 'Data Analyst', 'Data Scientist']
})
df

   nama  umur            pekerjaan
0  Andi    24  Frond-End Developer
1  Budi    18         Data Analyst
2  Caca    30       Data Scientist

In [10]:
df.to_json('data.json', orient = 'records')

In [11]:
dfjson = pd.read_json('data.json', orient = 'records')
dfjson

   nama  umur            pekerjaan
0  Andi    24  Frond-End Developer
1  Budi    18         Data Analyst
2  Caca    30       Data Scientist

# DATA WRANGLING